import nltk
import pprint


p = '''
성장률은 지난해 3분기 1.4%로 뛰었다가 4분기엔 -0.2%로 고꾸라졌다. 올해는 1분기에 1.0% 성장세로 돌아섰지만 2분기 0%대로 내려앉은 것이다.

부문별로 보면 투자와 소비가 모두 침체됐다. 민간소비와 정부소비는 0.3%씩 증가하는 데 그쳤다. 각각 1년6개월 만에, 4년3개월 만에 최저치다. 투자 쪽은 더 심각했다. 건설투자는 2.1%, 설비투자는 5.7% 감소했다. 지식재산생산물투자도 0.7% 줄었다. 이들 투자가 모조리 감소세로 돌아선 것은 2012년 2분기 후 처음이다.

업종별로는 제조업 생산 증가율이 1분기 1.6%에서 2분기 0.6%로 떨어졌고 건설업은 2.1%에서 -3.1%로 마이너스 전환했다. 서비스업 생산 증가율도 1분기 1.1%에서 2분기 0.5%로 반 토막이 났다. 경기를 떠받쳐온 수출 증가율(0.4%) 역시 크게 둔화되는 추세다. 수입은 3% 줄었다. 6년3개월 만에 가장 큰 감소세다.

전문가들은 2분기 경제 성적표가 최근의 내수 침체를 그대로 반영하고 있다고 분석했다. 주원 현대경제연구원 경제연구실장은 “내수가 0.7% 역성장하는 동안 순수출이 1.3% 늘어 겨우 0.6% 성장률을 맞출 수 있었다”며 “게다가 순수출 증가는 수출이 주도했다기보다 내수 불황 때문에 수입이 크게 감소해서 가능했던 것”이라고 진단했다. 수입 감소가 아니었다면 마이너스 성장을 했을 것이란 얘기다.

'''



sents = nltk.sent_tokenize(p)
print("NLTK")
pprint.pprint(sents)




from konlpy.tag import Kkma
kkma = Kkma()
sents = kkma.sentences(p)
print("KKMA")
pprint.pprint(sents)

