from __future__ import print_function
from textrankr import TextRank


txt = """
삼성전자는 21일 서울 강남구의 한 콘퍼런스홀에서 미디어 행사를 열고 의류관리기인 ‘에어드레서’를 공개했다. 에어드레서는 위아래에서 분사되는 강력한 바람과 스팀으로 옷에 묻은 먼지와 냄새를 빠르게 제거할 수 있도록 제작됐다. 이 제품에는 미세먼지 제거 기능이 장착돼 있어 외출 후 옷에 묻은 미세먼지를 99% 이상 제거해 준다. 특히 안감케어 옷걸이 기능으로 옷의 겉뿐만 아니라 안쪽까지 관리할 수 있다.

에어드레서는 인공지능(AI)과 사물인터넷(IoT)이 적용됐고 의류 소재별 최적 코스 추천부터 제품 관리까지 다양한 정보도 제공한다. 삼성전자는 에어드레서를 9월 출시할 예정이다.

삼성전자의 의류관리가전으로 시장 규모를 키워 관련 분야 1위 기업인 LG전자를 넘어서겠다는 입장이다. LG전자는 2011년 의류 관리 기기인 스타일러를 선보이며 시장을 개척했고 코웨이도 사계절 의류관리기를 출시하며 시장에 도전장을 내밀었다. 스타일러는 현재 13개 국가에서 출시돼 누적 25만대 판매했고 코웨이 역시 제품의 초도물량 1000대를 모두 판매했다. 때문에 삼성전자의 의류관리가전 출시에도 관심이 쏠렸다. 삼성전자는 지난해 국제가전박람회(IFA)에서 “먼저 선보여야 하는 제품과 차이가 있을 뿐 생활을 편리하게 해 주는 의류관리기 출시에 관심이 없지 않다”는 입장을 밝힌 바 있다.

김 사장은 “의류를 청정하게 해주는 만큼 의류관리기보다 의류청정기라는 표현을 쓰겠다”며 “제품이 좋기 때문에 상당히 큰 시장점유율을 가져가고 싶고 점유율은 100%였으면 좋겠다”고 강조했다.

이어 “렌털 업체 등과 협업해 소비자들이 다양한 경로로 에어드레서를 경험하도록 준비할 계획”이라며 “더 많은 의류를 보관할 수 있는 대형제품은 물론 미국 등 선진국 호텔과 거래하기 위한 마케팅도 펼쳐나가겠다”고 말했다.
"""



textrank = TextRank(txt)
print(textrank.summarize())

